# =============================================================================
# Brewfile — Best Mac Setup
# =============================================================================
# Curated from the actual packages on this machine. Organized by purpose.
# Run: brew bundle install
#
# Retro computing and hobby packages are in Brewfile.extras (optional).
# =============================================================================

# -----------------------------------------------------------------------------
# Taps
# -----------------------------------------------------------------------------
# (none for core setup — retro taps are in Brewfile.extras)

# -----------------------------------------------------------------------------
# Dotfile Management
# -----------------------------------------------------------------------------
brew "chezmoi"            # Dotfile manager with templates for multi-machine

# -----------------------------------------------------------------------------
# Terminal & Shell
# -----------------------------------------------------------------------------
brew "starship"           # Cross-shell prompt with git status, language versions
brew "tmux"               # Terminal multiplexer
brew "btop"               # Resource monitor (better top)
brew "htop"               # Process viewer
brew "macmon"             # macOS system monitor

# -----------------------------------------------------------------------------
# Developer CLI Tools
# -----------------------------------------------------------------------------
brew "gh"                 # GitHub CLI
brew "ripgrep"            # Fast grep (rg)
brew "shellcheck"         # Shell script linter
brew "mas"                # Mac App Store CLI
brew "dockutil"           # Dock management CLI
brew "p7zip"              # 7-zip archive support
brew "inetutils"          # telnet, ftp, etc.
brew "sshpass"            # Non-interactive SSH password auth

# -----------------------------------------------------------------------------
# Languages & Runtimes
# -----------------------------------------------------------------------------
brew "go"                 # Go programming language
brew "golangci-lint"      # Go linter
brew "node"               # Node.js
brew "nvm"                # Node Version Manager
brew "pyenv"              # Python version manager
brew "python@3.13"        # System Python
brew "rbenv"              # Ruby version manager
brew "ruby-build"         # rbenv plugin to install Ruby versions
brew "uv"                 # Fast Python package manager
brew "php@8.4"            # PHP (link: true for CLI availability)

# -----------------------------------------------------------------------------
# iOS / Xcode
# -----------------------------------------------------------------------------
brew "xcodegen"           # Generate Xcode projects from YAML
brew "xcodes"             # Xcode version manager

# -----------------------------------------------------------------------------
# Kubernetes
# -----------------------------------------------------------------------------
brew "k9s"                # Kubernetes TUI

# -----------------------------------------------------------------------------
# Version Control & Security
# -----------------------------------------------------------------------------
brew "gnupg"              # GPG for commit signing
brew "pinentry"           # GPG passphrase entry

# -----------------------------------------------------------------------------
# Media & Documents
# -----------------------------------------------------------------------------
brew "ffmpeg"             # Video/audio processing
brew "gifsicle"           # GIF optimization
brew "poppler"            # PDF rendering
brew "llmfit"             # LLM tooling

# -----------------------------------------------------------------------------
# Casks (GUI Applications)
# -----------------------------------------------------------------------------
cask "ghostty"            # GPU-accelerated terminal emulator
cask "codex"              # OpenAI Codex CLI
cask "macfuse"            # FUSE filesystem support

# -----------------------------------------------------------------------------
# Fonts
# -----------------------------------------------------------------------------
cask "font-jetbrains-mono-nerd-font"  # JetBrains Mono with Nerd Font icons
