# =============================================================================
# Brewfile — Best Mac Setup
# =============================================================================
# Curated list of packages for a productive developer workstation.
# Run: brew bundle install
#
# Philosophy: install what you actually use daily. Dependencies are pulled
# automatically. Retro computing, hobby, and work-specific tools go in
# Brewfile.extras (not tracked here).
# =============================================================================

# -----------------------------------------------------------------------------
# Taps
# -----------------------------------------------------------------------------
# (none required for core setup)

# -----------------------------------------------------------------------------
# Terminal & Shell
# -----------------------------------------------------------------------------
brew "starship"           # Cross-shell prompt with git status, language versions
brew "tmux"               # Terminal multiplexer
brew "btop"               # Resource monitor (better top)
brew "htop"               # Process viewer

# -----------------------------------------------------------------------------
# Dotfile Management
# -----------------------------------------------------------------------------
brew "chezmoi"            # Dotfile manager with templates for multi-machine

# -----------------------------------------------------------------------------
# Developer CLI Tools
# -----------------------------------------------------------------------------
brew "gh"                 # GitHub CLI
brew "ripgrep"            # Fast grep (rg)
brew "shellcheck"         # Shell script linter
brew "mas"                # Mac App Store CLI (for future use)
brew "dockutil"           # Dock management CLI

# -----------------------------------------------------------------------------
# Languages & Runtimes
# -----------------------------------------------------------------------------
brew "go"                 # Go programming language
brew "node"               # Node.js (system version, nvm for project-specific)
brew "nvm"                # Node Version Manager
brew "pyenv"              # Python version manager
brew "python@3.13"        # System Python
brew "rbenv"              # Ruby version manager
brew "ruby-build"         # rbenv plugin to install Ruby versions
brew "uv"                 # Fast Python package manager

# -----------------------------------------------------------------------------
# Version Control & Security
# -----------------------------------------------------------------------------
brew "gnupg"              # GPG for commit signing
brew "pinentry"           # GPG passphrase entry

# -----------------------------------------------------------------------------
# Media & Documents
# -----------------------------------------------------------------------------
brew "ffmpeg"             # Video/audio processing
brew "gifsicle"           # GIF optimization
brew "poppler"            # PDF rendering

# -----------------------------------------------------------------------------
# Casks (GUI Applications)
# -----------------------------------------------------------------------------
cask "ghostty"            # GPU-accelerated terminal emulator
cask "codex"              # OpenAI Codex CLI

# -----------------------------------------------------------------------------
# Fonts
# -----------------------------------------------------------------------------
cask "font-jetbrains-mono-nerd-font"  # JetBrains Mono with Nerd Font icons (for Starship)
